FKDD_COPY_DIFF_3_2026-02-14/Documents/ВыводИзЭксплуатацииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыводИзЭксплуатацииАвтомобилей</Name>
			<Comment>Вывод из эксплуатации автомобилей</Comment>
			<BasedOn>
				<xr:Item>Document.ВводВЭксплуатациюАвтомобилей</xr:Item>
				<xr:Item>Document.ПеремещениеАктивов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АвтомобилиДляТестДрайва</xr:Item>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ПрочиеАктивыВЭксплуатации</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.КомплектацияАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Comment>Сотрудник, заключивший сделку с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыВзаиморасчетов</Name>
					<Comment>Курс валюты взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВЭксплуатациюАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект, под который выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОтгрузки</Name>
					<Comment>Подразделение отгрузки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Активы</Name>
					<Comment>Активы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрочийАктив</Name>
							<Comment>Прочий актив</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Comment>Автомобиль</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма реализации актива</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/АвтомобилиДляТестДрайва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>АвтомобилиДляТестДрайва</Name>
			<Comment>Автомобили для тест-драйва</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МаксимальныйПробег</Name>
					<Comment>Максимальный пробег</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяПродолжительностьЭксплуатации</Name>
					<Comment>Максимальная продолжительность эксплуатации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Comment>Актив</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ГраницыКомплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГраницыКомплектация</Name>
			<Comment>Границы последовательности комплектации автомобилей</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МоментВремени</Name>
					<Comment>Момент времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСсылка</Name>
					<Comment>Документ ссылка</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/СпособКонтроляКорректностиДоговораИСкладаДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособКонтроляКорректностиДоговораИСкладаДокумента</Name>
			<Comment>Способ контроль соответствия организации/подразделения и договора (склада)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтрольОтсутствует</Name>
					<Comment>Контроль отсутствует</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольПоОрганизации</Name>
					<Comment>Контроль по организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольПоОрганизацииИПодразделению</Name>
					<Comment>Контроль по организации и подразделению</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ВыводИзЭксплуатацииАвтомобилей/Ext/ObjectModule.bsl
// Модуль документа РеализацияАктивов

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ВалютаКурсДок Экспорт;        // Кэш валюты и курса документа
Перем тКэшСуммСписания Экспорт;		// Переменная для кэширования результатов вычисления суммы списания
Перем ФлагПерерасчет;               // Переменная для обозначения того, что ведется перерасчет суммы документа
Перем РезультатЗапросаПоТоварам;
Перем РезультатЗапросаПоАктивам;
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Возвращает результат запроса по товарам, соответствующим активам табличной части
//
// Возвращаемое значение:
//  Возвращает результат запроса.
//
Функция ПолучитьРезультатЗапросаПоТоварам(СписокАвтомобилей)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура КАК Номенклатура,
	               |	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
				   |	ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) КАК СкладКомпании,
				   |	ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка) КАК Партия,
	               |	0 КАК ВидДвижения,
	               |	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный) КАК СтатусПартии,
	               |	РеализацияАктивовАктивы.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияАктивовАктивы.Сумма КАК Сумма,
	               |	0 КАК СуммаУпр,
	               |	РеализацияАктивовАктивы.СуммаНДС КАК СуммаНДС,
	               |	0 КАК СуммаСкидки,
	               |	РеализацияАктивовАктивы.Количество
	               |ИЗ
	               |	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
	               |ГДЕ
	               |	РеализацияАктивовАктивы.Ссылка = &Ссылка
				   |	"+?(СписокАвтомобилей=Неопределено,"","И НЕ РеализацияАктивовАктивы.ПрочийАктив В (&СписокАвтомобилей)")+"
				   |";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СписокАвтомобилей", СписокАвтомобилей);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьРезультатЗапросаПоТоварам()

// сформирует свой результат запроса по активам
//
// Возвращаемое значение:
//  Возвращает результат запроса.
//
Функция ПолучитьРезультатЗапросаПоАктивам()
	ТекстЗапроса = "ВЫБРАТЬ
	               |	РеализацияАктивовАктивы.ПрочийАктив КАК Актив,
	               |	РеализацияАктивовАктивы.Сумма КАК Сумма,
	               |	РеализацияАктивовАктивы.Количество
	               |ИЗ
	               |	Документ.ВыводИзЭксплуатацииАвтомобилей.Активы КАК РеализацияАктивовАктивы
	               |ГДЕ
	               |	РеализацияАктивовАктивы.Ссылка = &Ссылка";

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();
КонецФункции // ПолучитьРезультатЗапросаПоАктивам()

// Возвращает результат запроса по партиям,соответствующим активам табличной части
//
// Возвращаемое значение:
//  Возвращает результат запроса.
//
Функция ПолучитьРезультатЗапросаПоПартиям(СписокАвтомобилей)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияАктивовАктивы.ПрочийАктив КАК ПрочийАктив,
	               |	РеализацияАктивовАктивы.Количество
	               |ПОМЕСТИТЬ РеализацияАктивовАктивы
	               |ИЗ
	               |	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
	               |ГДЕ
	               |	РеализацияАктивовАктивы.Ссылка = &Ссылка
				   |	"+?(СписокАвтомобилей=Неопределено,"","И НЕ РеализацияАктивовАктивы.ПрочийАктив В (&СписокАвтомобилей)")+"
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПрочийАктив
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПрочиеАктивыВЭксплуатации.ПрочийАктив.Номенклатура КАК Номенклатура,
				   |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
				   |	ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) КАК СкладКомпании,
				   |	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный) КАК СтатусПартии,
				   |	ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка) КАК Партия,
	               |	ВЫБОР
	               |		КОГДА ПрочиеАктивыВЭксплуатации.КоличествоОстаток = РеализацияАктивовАктивы.Количество
	               |			ТОГДА ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьОстаток - ПрочиеАктивыВЭксплуатации.СуммаАмортизацииОстаток
	               |		КОГДА ПрочиеАктивыВЭксплуатации.КоличествоОстаток<>0 
				   |			ТОГДА ((ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьОстаток - ПрочиеАктивыВЭксплуатации.СуммаАмортизацииОстаток) / ПрочиеАктивыВЭксплуатации.КоличествоОстаток) * РеализацияАктивовАктивы.Количество
				   |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА ПрочиеАктивыВЭксплуатации.КоличествоОстаток = РеализацияАктивовАктивы.Количество
	               |			ТОГДА ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьУпрОстаток - ПрочиеАктивыВЭксплуатации.СуммаАмортизацииУпрОстаток
	               |		КОГДА ПрочиеАктивыВЭксплуатации.КоличествоОстаток<>0
				   |			ТОГДА ((ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьУпрОстаток - ПрочиеАктивыВЭксплуатации.СуммаАмортизацииУпрОстаток) / ПрочиеАктивыВЭксплуатации.КоличествоОстаток) * РеализацияАктивовАктивы.Количество
				   |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаУпр,
	               |	0 КАК ВидДвижения,
	               |	0 КАК СуммаНДС,
	               |	РеализацияАктивовАктивы.Количество
	               |ИЗ
	               |	РеализацияАктивовАктивы КАК РеализацияАктивовАктивы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки(
	               |				&Момент,
	               |				ПрочийАктив В
	               |					(ВЫБРАТЬ
	               |						РеализацияАктивовАктивы.ПрочийАктив
	               |					ИЗ
	               |						РеализацияАктивовАктивы)) КАК ПрочиеАктивыВЭксплуатации
	               |		ПО РеализацияАктивовАктивы.ПрочийАктив = ПрочиеАктивыВЭксплуатации.ПрочийАктив";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
    Запрос.УстановитьПараметр("Момент", МоментВремени());
	Запрос.УстановитьПараметр("СписокАвтомобилей", СписокАвтомобилей);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьРезультатЗапросаПоПартиям()

// Возвращает результат запроса по автомобилям, соответствующим активам табличной части
//
// Возвращаемое значение:
//  Возвращает результат запроса.
//
Функция ПолучитьРезультатЗапросаПоАвтомобилям(Запрос)
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияАктивовАктивы.ПрочийАктив КАК ПрочийАктив,
	|	РеализацияАктивовАктивы.Количество КАК Количество,
	|	РеализацияАктивовАктивы.Сумма КАК Сумма,
	|	РеализацияАктивовАктивы.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияАктивовАктивы.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ РеализацияАктивовАктивы
	|ИЗ
	|	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
	|ГДЕ
	|	РеализацияАктивовАктивы.Ссылка = &Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	ПрочийАктив
	|;
	|ВЫБРАТЬ
	|	ВводВЭксплуатациюАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	РеализацияАктивовАктивы.ПрочийАктив КАК ПрочийАктив,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры,
	|	ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка) КАК СкладКомпании,
	|	ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка) КАК ДокументПоставки,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Поставщик,
	|	0 КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный) КАК СтатусПартии,
	|	РеализацияАктивовАктивы.СтавкаНДС КАК СтавкаНДС,
	|	РеализацияАктивовАктивы.Сумма КАК Сумма,
	|	0 КАК СуммаУпр,
	|	РеализацияАктивовАктивы.СуммаНДС КАК СуммаНДС,
	|	0 КАК СуммаСкидки,
	|	РеализацияАктивовАктивы.Количество КАК Количество,
	|	ЕСТЬNULL(ДвиженияВЭксплуатации.СуммаУпр, 0) КАК Себестоимость,
    |	0 КАК СебестоимостьКомплектация,
    |	ЕСТЬNULL(ДвиженияВЭксплуатации.Сумма, 0) КАК СебестоимостьРегл,
    |	0 КАК СебестоимостьКомплектацияРегл,
	|	0 КАК СуммаНДСВходящий,
	|	0 КАК СуммаНДСВходящийКомплектация
	|
	|ИЗ
	|	РеализацияАктивовАктивы КАК РеализацияАктивовАктивы
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводВЭксплуатациюАвтомобилей.Автомобили КАК ВводВЭксплуатациюАвтомобилейАвтомобили
	|	ПО РеализацияАктивовАктивы.ПрочийАктив = ВводВЭксплуатациюАвтомобилейАвтомобили.Актив
	|ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияПрочиеАктивыВЭксплуатации КАК ДвиженияВЭксплуатации
	|	ПО РеализацияАктивовАктивы.ПрочийАктив = ДвиженияВЭксплуатации.ПрочийАктив";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьРезультатЗапросаПоАвтомобилям()

// возвращает выборку по шапке
//
// Параметры:
//  ДокументСсылка - Ссылка на документ для которого получаем шапку.
//
// Возвращаемое значение:
//  Выборка - выборка по шапке
//
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции // ПолучитьШапкуДокумента()

Функция ВернутьАвтомобилиНаСклад(Отказ)
	// получим список документов двинувших регистр активов при поступлении указанных авто
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеАктивыВЭксплуатации.Регистратор КАК ДокументДвижения
	|ПОМЕСТИТЬ ТаблРегистраторов
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыВЭксплуатации КАК ПрочиеАктивыВЭксплуатации
	|ГДЕ
	|	ПрочиеАктивыВЭксплуатации.ПрочийАктив В(&СписокПрочихАктив)
	|	И ПрочиеАктивыВЭксплуатации.Автомобиль В(&СписокАвтомобилей)
	|	И ПрочиеАктивыВЭксплуатации.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
	|	И ПрочиеАктивыВЭксплуатации.ВидДвижения = &ВидДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеАктивыВЭксплуатации.Регистратор
	|;
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилей.ГТД,
	|	ОстаткиАвтомобилей.Сумма КАК Сумма,
	|	ОстаткиАвтомобилей.СуммаУпр КАК СуммаУпр,
	|	NULL КАК Номенклатура,
	|	NULL КАК ХарактеристикаНоменклатуры,
	|	1 КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Регистратор В
	|			(ВЫБРАТЬ
	|				ТаблРегистраторов.ДокументДвижения
	|			ИЗ
	|				ТаблРегистраторов КАК ТаблРегистраторов)
	|	И ОстаткиАвтомобилей.Автомобиль В(&СписокАвтомобилей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КомплектацияАвтомобилей.Автомобиль,
	|	КомплектацияАвтомобилей.ГТД,
	|	КомплектацияАвтомобилей.Сумма,
	|	КомплектацияАвтомобилей.СуммаУпр,
	|	КомплектацияАвтомобилей.Номенклатура,
	|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
	|	КомплектацияАвтомобилей.Количество
	|ИЗ
	|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	|ГДЕ
	|	КомплектацияАвтомобилей.Регистратор В
	|			(ВЫБРАТЬ
	|				ТаблРегистраторов.ДокументДвижения
	|			ИЗ
	|				ТаблРегистраторов КАК ТаблРегистраторов)
	|	И КомплектацияАвтомобилей.Автомобиль В(&СписокАвтомобилей)
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаУпр)
	|ПО
	|	Автомобиль";
	
	Запрос.УстановитьПараметр("СписокПрочихАктив", Активы.ВыгрузитьКолонку("ПрочийАктив"));
	Запрос.УстановитьПараметр("СписокАвтомобилей", Активы.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	ВыборкаАвтомобилей = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Пока ВыборкаАвтомобилей.Следующий() Цикл
		ВыборкаДетальная = ВыборкаАвтомобилей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// получим сумму по документу
		СтруктураПоиска = Новый Структура("Автомобиль",ВыборкаАвтомобилей.Автомобиль);
		МассивНайденныхСумм = Активы.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСумм.Количество() > 0 Тогда
			СуммаВВалДок = МассивНайденныхСумм[0].Сумма;
		Иначе
			СуммаВВалДок = 0;
		КонецЕсли;
		
		Если ВалютаДокумента = ВалютаУпр Тогда
			СуммаВВалУпр  = СуммаВВалДок;
			СуммаВВалРегл = обПересчет(СуммаВВалДок,ВалютаДокумента,КурсДокумента,ВалютаРегл,Дата);
		ИначеЕсли ВалютаДокумента = ВалютаРегл Тогда
			СуммаВВалУпр  = обПересчет(СуммаВВалДок,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
			СуммаВВалРегл = СуммаВВалДок;
		Иначе
			СуммаВВалУпр  = обПересчет(СуммаВВалДок,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсВалютыУпр);
			СуммаВВалРегл = обПересчет(СуммаВВалДок,ВалютаДокумента,КурсДокумента,ВалютаРегл,Дата);
		КонецЕсли;
		
		РасчетнаяУпр   = ВыборкаАвтомобилей.СуммаУпр;
		РасчетанаяРегл = ВыборкаАвтомобилей.Сумма;
		
		Если РасчетнаяУпр <> 0 Тогда
			ЦенаЗаЕдУпр = СуммаВВалУпр/РасчетнаяУпр;
		Иначе
			ЦенаЗаЕдУпр = 0;
		КонецЕсли;
		
		Если РасчетанаяРегл <> 0 Тогда
			ЦенаЗаЕдРегл = СуммаВВалРегл/РасчетанаяРегл;
		Иначе
			ЦенаЗаЕдРегл = 0;
		КонецЕсли;
		
		Если ЦенаЗаЕдУпр < 0.01 ИЛИ ЦенаЗаЕдРегл < 0.01 Тогда
			ЦенаЗаЕдУпр = 0;
			ЦенаЗаЕдРегл = 0;
		КонецЕсли;
		
		Пока ВыборкаДетальная.Следующий() Цикл
			// пройдемся и вернем опции
			Если обЗначениеНеЗаполнено(ВыборкаДетальная.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			// измерения
			НоваяЗапись = Движения.КомплектацияАвтомобилей.Добавить();
			НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
			НоваяЗапись.СкладКомпании              = СкладКомпании;
			НоваяЗапись.Регистратор                = Ссылка;
			НоваяЗапись.Период                     = Дата;
			НоваяЗапись.Автомобиль                 = ВыборкаДетальная.Автомобиль;
			НоваяЗапись.Номенклатура               = ВыборкаДетальная.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ВыборкаДетальная.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтатусПартии               = Перечисления.СтатусыПартий.ТоварКупленный;
			НоваяЗапись.Партия                     = Ссылка;
			НоваяЗапись.ГТД                        = ВыборкаДетальная.ГТД;
			
			//ресурсы
			НоваяЗапись.Количество                 = ВыборкаДетальная.Количество;
			НоваяЗапись.Сумма                      = ВыборкаДетальная.Сумма*ЦенаЗаЕдРегл;
			НоваяЗапись.СуммаУпр                   = ВыборкаДетальная.СуммаУпр*ЦенаЗаЕдУпр;
			НоваяЗапись.СуммаНДС                   = 0;
			НоваяЗапись.СуммаПродажи               = 0;
			НоваяЗапись.СуммаПродажиУпр            = 0;
			
			// реквизиты
			НоваяЗапись.ХозОперация                = ХозОперация;
			НоваяЗапись.СтавкаНДС                  = Справочники.СтавкиНДС.БезНДС;
			
			СуммаВВалУпр  = СуммаВВалУпр - НоваяЗапись.СуммаУпр;
			СуммаВВалРегл = СуммаВВалРегл - НоваяЗапись.Сумма;
		КонецЦикла;
		
		ВыборкаДетальная.Сбросить();
		Пока ВыборкаДетальная.Следующий() Цикл
			// оприходуем авто
			Если НЕ обЗначениеНеЗаполнено(ВыборкаДетальная.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = Движения.ОстаткиАвтомобилей.Добавить();
			
			// измерения
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Регистратор   = Ссылка;
			НоваяЗапись.Период        = Дата;
			НоваяЗапись.Автомобиль    = ВыборкаДетальная.Автомобиль;
			НоваяЗапись.СкладКомпании = СкладКомпании;
			НоваяЗапись.СтатусПартии  = Перечисления.СтатусыПартий.ТоварКупленный;
			НоваяЗапись.Партия        = Ссылка;
			НоваяЗапись.ГТД           = ВыборкаДетальная.ГТД;
			
			НоваяЗапись.Количество    = 1;
			НоваяЗапись.Сумма         = СуммаВВалРегл;
			НоваяЗапись.СуммаУпр      = СуммаВВалУпр;
			НоваяЗапись.СуммаНДС      = 0;
			
			НоваяЗапись.СтавкаНДС     = Справочники.СтавкиНДС.БезНДС;
			НоваяЗапись.ХозОперация   = ХозОперация;
			Прервать;
		КонецЦикла;
	КонецЦикла;
КонецФункции

Процедура ПроверитьСоответствиеАктивовИАвтомобилей(РежимЗаписи,Отказ)
	// проверим возможность проведения
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрочиеАктивыВЭксплуатацииОстатки.ПрочийАктив,
		|	ПрочиеАктивыВЭксплуатацииОстатки.Автомобиль
		|ИЗ
		|	РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки КАК ПрочиеАктивыВЭксплуатацииОстатки
		|ГДЕ
		|	ПрочиеАктивыВЭксплуатацииОстатки.ПрочийАктив В(&СписокПрочийАктив)";
		Запрос.УстановитьПараметр("СписокПрочийАктив", Активы.ВыгрузитьКолонку("ПрочийАктив"));
		Выборка = Запрос.Выполнить().Выбрать();
		
		Ошибки = "";
		Для Каждого стрАктив Из Активы Цикл
			стрПоиска = Новый Структура("ПрочийАктив,Автомобиль",стрАктив.ПрочийАктив,стрАктив.Автомобиль);
			Выборка.Сбросить();
			Если НЕ Выборка.НайтиСледующий(стрПоиска) Тогда
				Отказ = Истина;
				дкДобавитьОшибку(Ошибки, "Актив <" + стрАктив.ПрочийАктив + "> и автомобиль <" +стрАктив.Автомобиль+ "> в строке №" + стрАктив.НомерСтроки + " не соответствуют друг другу.");
			КонецЕсли;
		КонецЦикла;
		
		
		Если Отказ Тогда
			Сообщить("При проведении документа возникли ошибки:",СтатусСообщения.Важное);
			Сообщить(Ошибки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы активов
	ОбязательныеАктивы = Новый Структура();
	ОбязательныеАктивы.Вставить("ПрочийАктив", 3);
	ОбязательныеАктивы.Вставить("Автомобиль", 3);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты = Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании", 1);
	ОбязательныеРеквизиты.Вставить("Автор", 1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента", 1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента", 1);
	ОбязательныеРеквизиты.Вставить("ХозОперация", 1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеОтгрузки", 1);
	ОбязательныеРеквизиты.Вставить("СкладКомпании", 1);
	ОбязательныеРеквизиты.Вставить("Активы", ОбязательныеАктивы);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
						
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);		
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) и Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Активы Цикл
		Если НЕ (ТекСтрока.ПрочийАктив.ВидПрочегоАктива = Перечисления.ВидыПрочихАктивов.Спецодежда ИЛИ
			     ТекСтрока.ПрочийАктив.ВидПрочегоАктива = Перечисления.ВидыПрочихАктивов.Спецоснастка ИЛИ
				 ТекСтрока.ПрочийАктив.ВидПрочегоАктива = Перечисления.ВидыПрочихАктивов.Инструменты) Тогда
			Если НЕ (ТекСтрока.Количество = 1) Тогда
				ТекСтрока.Количество = 1;
				#Если Клиент Тогда
				Сообщить("Табличная часть ""Активы"" строка " + ТекСтрока.НомерСтроки + ": количество актива """ + СокрЛП(ТекСтрока.ПрочийАктив) + """ заменено на 1,000.", СтатусСообщения.Важное);
				#КонецЕсли
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ВыводИзЭксплуатацииАвтомобилей", "Вывод из эксплуатации автомобилей", Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// формирует движения документа по партионным регистрам
//
// Параметры:
//  Режим           - режим проведения (оперативный/неоперативный)
//  ДокументСсылка  - ссылка на документ который надо допровести по партиям
//
// Возвращаемое значение:
//  Возвращает Истина - все ОК, ложь - чего-то не так
//
Функция ПровестиПоПартиям(Режим,ДокументСсылка=Неопределено) Экспорт
	Отказ=Ложь;
	Возврат НЕ Отказ;
КонецФункции // ПровестиПоПартиям()

// Расчет общей суммы реализации
//
// Возвращаемое значение:
//  СуммаВсего - число.
//
Функция РассчитатьСуммуВсего() Экспорт
	СуммаВсего = дкПолучитьСуммуСписания(ЭтотОбъект, "ПрочиеАктивыВЭксплуатации", тКэшСуммСписания);
	Возврат СуммаВсего;
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			- Строка - Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	- Форма	 - Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя = "ВалютаДокумента" И (ВалютаКурсДок.Валюта <> ВалютаДокумента ИЛИ ВалютаКурсДок.Курс <> КурсДокумента) Тогда
		ВалютаКурсДок.Валюта = ВалютаДокумента;
		ВалютаКурсДок.Курс = КурсДокумента;
		Возврат Истина;
		
	ИначеЕсли Имя = "Организация" Тогда
		ОсвобожденОтНДС = Ложь;
		Если ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС Тогда
			ОсвобожденОтНДС = Истина;
		КонецЕсли; 
		Для Каждого Строка Из Активы Цикл
			Если ОсвобожденОтНДС Тогда
				Строка.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			Иначе
				Строка.СтавкаНДС = Строка.ПрочийАктив.Номенклатура.СтавкаНДС;
			КонецЕсли; 
			ОбработкаРеквизита("Активы.СтавкаНДС", Строка, ЭтаФорма);
		КонецЦикла;
		Возврат дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
	ИначеЕсли Имя = "Активы.Актив" Тогда
		//получим остаточную стоимость из регистра		
		Если ЭтоНовый() Тогда
			МоментВремени = ТекущаяДата();
		Иначе
			МоментВремени = ?(Проведен, Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая), КонецМесяца(Дата));
		КонецЕсли;
		
		ТаблАктив = дкПолучитьОстаткиАктивов(ПодразделениеОтгрузки, , ТекСтрока.ПрочийАктив, МоментВремени);
		
		// заполним реквизиты
		Если ТаблАктив.Количество() = 0 Тогда
			#Если Клиент Тогда
				Сообщить("Прочий актив """ + СокрЛП(ТекСтрока.ПрочийАктив) + """. Подразделение """ + СокрЛП(ПодразделениеОтгрузки) + """. Не обнаружен", СтатусСообщения.Внимание);
			#КонецЕсли
		Иначе
			ТекСтрока.Автомобиль = ТаблАктив[0].Автомобиль;
			ТекСтрока.Количество = 1;
			Если ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
				БалансоваяСтоимость_ = ТаблАктив[0].БалансоваяСтоимостьРегл;
				СуммаАмортизации_   = ТаблАктив[0].АмортизацияРегл;
			Иначе
				БалансоваяСтоимость_ = обПересчет(ТаблАктив[0].БалансоваяСтоимость, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ?(обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр), Дата, ЭтотОбъект.КурсВалютыУпр), ВалютаДокумента, КурсДокумента);
				СуммаАмортизации_   = обПересчет(ТаблАктив[0].Амортизация, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ?(обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр), Дата, ЭтотОбъект.КурсВалютыУпр), ВалютаДокумента, КурсДокумента);
			КонецЕсли; 
			ТекСтрока.Сумма = БалансоваяСтоимость_ - СуммаАмортизации_;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "Активы.Автомобиль" Тогда
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция ПечатьВыводИзЭксплуатацииАвтомобилей(ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("РеализацияАктивов");
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
	ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	ОбластьМакета.Параметры.ПредставлениеОрганизации	= спПолучитьПредставление(Организация, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПодразделения	= спПолучитьНаименование(ПодразделениеКомпании);
	ОбластьМакета.Параметры.ПредставлениеКонтрагента	= спПолучитьПредставление(ПодразделениеОтгрузки);
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СтоимостьРеализации",ВалютаДокумента,0);
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	Если Проведен Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	РеализацияАктивовАктивы.НомерСтроки,
		|	ПрочиеАктивыВЭксплуатации.ПрочийАктив КАК ПрочийАктив,
		|	РеализацияАктивовАктивы.Сумма КАК СтоимостьРеализации,
		|	ВЫБОР
		|		КОГДА ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьУпр ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ПрочиеАктивыВЭксплуатации.БалансоваяСтоимостьУпр * &МножительКурса
		|	КОНЕЦ - ВЫБОР
		|		КОГДА ПрочиеАктивыВЭксплуатации.СуммаАмортизацииУпр ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ПрочиеАктивыВЭксплуатации.СуммаАмортизацииУпр * &МножительКурса
		|	КОНЕЦ КАК ОстаточнаяСтоимость
		|ИЗ
		|	Документ.ВыводИзЭксплуатацииАвтомобилей.Активы КАК РеализацияАктивовАктивы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыВЭксплуатации КАК ПрочиеАктивыВЭксплуатации
		|		ПО РеализацияАктивовАктивы.ПрочийАктив = ПрочиеАктивыВЭксплуатации.ПрочийАктив
		|ГДЕ
		|	ПрочиеАктивыВЭксплуатации.ВидДвижения = &ВидДвиженияНакопленияРасход
		|	И ПрочиеАктивыВЭксплуатации.Регистратор = &Ссылка
		|	И РеализацияАктивовАктивы.Ссылка = &Ссылка";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("ВидДвиженияНакопленияРасход",ВидДвиженияНакопления.Расход);
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр) Тогда
			МножительКурса = обПересчет(1, ВалютаУправленческогоУчета, Дата , ВалютаДокумента, КурсДокумента);
		Иначе
			МножительКурса = обПересчет(1, ВалютаУправленческогоУчета, КурсВалютыУпр, ВалютаДокумента, КурсДокумента);
		КонецЕсли;
		Запрос.УстановитьПараметр("МножительКурса",МножительКурса);
		ВыборкаТабличнойЧасти = Запрос.Выполнить().Выгрузить();
	Иначе
		Сообщить("Документ не проведен данные о остаточной стоимости не доступны!", СтатусСообщения.Важное);
		ВыборкаТабличнойЧасти = Активы.Выгрузить();
		ВыборкаТабличнойЧасти.Колонки.Добавить("ОстаточнаяСтоимость", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(15,2)));
		ВыборкаТабличнойЧасти.ЗаполнитьЗначения(0, "ОстаточнаяСтоимость");
		ВыборкаТабличнойЧасти.Колонки.Сумма.Имя = "СтоимостьРеализации";
	КонецЕсли;
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//перебор строк
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);
		ОбластьМакета.Параметры.ПрочийАктив			= СтрокаТабличнойЧасти.ПрочийАктив;
		ОбластьМакета.Параметры.АктивНаименование	= спПолучитьНаименование(СтрокаТабличнойЧасти.ПрочийАктив);
		ОбластьМакета.Параметры.Код					= СтрокаТабличнойЧасти.ПрочийАктив.ИнвентарныйНомер;
		ОбластьМакета.Параметры.ОстаточнаяСтоимость	= Формат(СтрокаТабличнойЧасти.ОстаточнаяСтоимость,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СтоимостьРеализации	= Формат(СтрокаТабличнойЧасти.СтоимостьРеализации,ФорматВыводаСуммы);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СтоимостьРеализации",ВалютаДокумента,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаДокумента;
	СуммаВсего = ВыборкаТабличнойЧасти.Итог("СтоимостьРеализации");
	ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.ПолучилКонтрагентПредставление = ?(обЗначениеНеЗаполнено(Получил.Получилконтрагент),"","/ "+ Получил.ПолучилКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьРеализацияАктивов()


// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура -  обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВводВЭксплуатациюАвтомобилей") Тогда
		ПодразделениеОтгрузки = Основание.ПодразделениеПолучатель;
		ПодразделениеКомпании = Основание.ПодразделениеПолучатель;
		
		Запрос =  Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводВЭксплуатациюАвтомобилейАвтомобили.Актив,
		|	ВводВЭксплуатациюАвтомобилейАвтомобили.Автомобиль,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.БалансоваяСтоимостьОстаток, 0) - ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.СуммаАмортизацииОстаток, 0) КАК Себестоимость,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.БалансоваяСтоимостьУпрОстаток, 0) - ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.СуммаАмортизацииУпрОстаток, 0) КАК СебестоимостьУпр
		|ИЗ
		|	Документ.ВводВЭксплуатациюАвтомобилей.Автомобили КАК ВводВЭксплуатациюАвтомобилейАвтомобили
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки КАК ПрочиеАктивыВЭксплуатацииОстатки
		|		ПО ВводВЭксплуатациюАвтомобилейАвтомобили.Автомобиль = ПрочиеАктивыВЭксплуатацииОстатки.Автомобиль
		|			И ВводВЭксплуатациюАвтомобилейАвтомобили.Актив = ПрочиеАктивыВЭксплуатацииОстатки.ПрочийАктив
		|ГДЕ
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.КоличествоОстаток, 0) > 0
		|	И ВводВЭксплуатациюАвтомобилейАвтомобили.Ссылка = &Основание";
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Активы.Добавить();
			НоваяСтрока.Автомобиль  = Выборка.Автомобиль;
			НоваяСтрока.ПрочийАктив = Выборка.Актив;
			НоваяСтрока.Количество  = Выборка.Количество;
			
			Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
				НоваяСтрока.Сумма = Выборка.Себестоимость;
			ИначеЕсли ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить() Тогда
				НоваяСтрока.Сумма = Выборка.СебестоимостьУпр;
			Иначе
				НоваяСтрока.Сумма = обПересчет(Выборка.СебестоимостьУпр,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеАктивов") Тогда
		Активы.Очистить();
		ПодразделениеОтгрузки = Основание.ПодразделениеПолучатель;
		
		Запрос =  Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПеремещениеАктивовАвтомобили.ПрочийАктив КАК Актив,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.Автомобиль,Неопределено) КАК Автомобиль,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.БалансоваяСтоимостьОстаток, 0) - ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.СуммаАмортизацииОстаток, 0) КАК Себестоимость,
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.БалансоваяСтоимостьУпрОстаток, 0) - ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.СуммаАмортизацииУпрОстаток, 0) КАК СебестоимостьУпр
		|ИЗ
		|	Документ.ПеремещениеАктивов.Активы КАК ПеремещениеАктивовАвтомобили
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки КАК ПрочиеАктивыВЭксплуатацииОстатки
		|		ПО ПеремещениеАктивовАвтомобили.ПрочийАктив = ПрочиеАктивыВЭксплуатацииОстатки.ПрочийАктив
		|ГДЕ
		|	ЕСТЬNULL(ПрочиеАктивыВЭксплуатацииОстатки.КоличествоОстаток, 0) > 0
		|	И ПеремещениеАктивовАвтомобили.Ссылка = &Основание";
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если обЗначениеНеЗаполнено(Выборка.Автомобиль) Тогда Продолжить; КонецЕсли;
			НоваяСтрока = Активы.Добавить();
			НоваяСтрока.Автомобиль  = Выборка.Автомобиль;
			НоваяСтрока.ПрочийАктив = Выборка.Актив;
			НоваяСтрока.Количество  = Выборка.Количество;
			
			Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
				НоваяСтрока.Сумма = Выборка.Себестоимость;
			ИначеЕсли ВалютаДокумента = Константы.ВалютаУправленческогоУчетаКомпании.Получить() Тогда
				НоваяСтрока.Сумма = Выборка.СебестоимостьУпр;
			Иначе
				НоваяСтрока.Сумма = обПересчет(Выборка.СебестоимостьУпр,Константы.ВалютаУправленческогоУчетаКомпании.Получить(),КурсВалютыУпр,ВалютаДокумента,КурсДокумента);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Результат = Истина;
	ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("АвтомобильБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если Не ФлагПерерасчет Тогда
		Результат = дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;
	ФлагПерерасчет = Ложь;
	Если НЕ Результат Тогда Возврат; КонецЕсли; 
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// автомобили
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// комплектация
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильБыл", Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Если Не Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = 0;
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	РезультатЗапросаПоАктивам = ПолучитьРезультатЗапросаПоАктивам().Выгрузить().Скопировать();

	ПроверитьСоответствиеАктивовИАвтомобилей(Режим, Отказ);
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);
	
	// 1) спишем из "Активов в эксплуатации"
	НаборЗаписейЭксплуатация = Движения.ПрочиеАктивыВЭксплуатации;
	НаборЗаписейЭксплуатация.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейЭксплуатация.ПодразделениеКомпании     = ПодразделениеКомпании;
	НаборЗаписейЭксплуатация.ЭтоВыбытие                = Истина;
	НаборЗаписейЭксплуатация.РезультатЗапросаПоАктивам = РезультатЗапросаПоАктивам;
	Отказ = НЕ НаборЗаписейЭксплуатация.Расход() ИЛИ Отказ;
	
	// 2) Проведем по ТестДрайву
	НаборЗаписейТестДрайв = Движения.АвтомобилиДляТестДрайва;
	НаборЗаписейТестДрайв.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейТестДрайв.ПодразделениеКомпании = ПодразделениеКомпании;
	НаборЗаписейТестДрайв.РезультатЗапросаПоАвтомобилям = НаборЗаписейЭксплуатация.Выгрузить();
	НаборЗаписейТестДрайв.Расход();
	
	// 3) Проведем про остаткам авто и резервам
	ВернутьАвтомобилиНаСклад(Отказ);
	
	//4) запишем ДиР
	СуммаПоАктивам   = Движения.ПрочиеАктивыВЭксплуатации.Итог("БалансоваяСтоимостьУпр") - Движения.ПрочиеАктивыВЭксплуатации.Итог("СуммаАмортизацииУпр");
	СуммаПоДокументу = Движения.КомплектацияАвтомобилей.Итог("СуммаУпр") + Движения.ОстаткиАвтомобилей.Итог("СуммаУпр");
	
	СуммаРазница = СуммаПоДокументу - СуммаПоАктивам;
	
	Если Окр(обМод(СуммаРазница), 2, РежимОкругления.Окр15как20) >= 0.01 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект			= ЭтотОбъект;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;		
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.СписаниеАктивов;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			Если СуммаРазница > 0 Тогда
				НаборЗаписейДиР.Доход  = СуммаРазница;
			Иначе
				НаборЗаписейДиР.Расход  = СуммаРазница;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если Не Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = РассчитатьСуммуВсего();
		ФлагПерерасчет = Истина;
		Записать();
	КонецЕсли;
	
	// Возможно расхождение баланса на "копейки" из-за округления. Возникшую разницу
	// необходимо списать на доходы и расходы.
	Отказ = НЕ дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ЭтотОбъект) ИЛИ Отказ;
	
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл) Тогда
		// двигаем границу последовательности автомобилей
		НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= СкладКомпании;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= Дата;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыАвтомобили.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	КонецЕсли;
	
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.КомплектацияАвтомобилей.Количество()>0);
	// двигаем границу последовательности комплектаций автомобилей
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильБыл) Тогда
		НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаАвтомобилей = Движения.КомплектацияАвтомобилей.Выгрузить();
			ТаблицаАвтомобилей.Свернуть("Автомобиль","");
			НаборЗаписейГраницыКомплектация.Автомобиль = ТаблицаАвтомобилей.ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыКомплектация.МоментВремени  	 = Дата;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыКомплектация.Автомобиль		 = ДополнительныеСвойства.АвтомобильБыл;
			НаборЗаписейГраницыКомплектация.МоментВремени	 = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = Неопределено;
			НаборЗаписейГраницыКомплектация.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыКомплектация.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыКомплектация.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
// инициализация кэша
ВалютаКурсДок = Новый Структура("Валюта, Курс", ВалютаДокумента, КурсДокумента);
ФлагПерерасчет = Ложь;
